Repository: gabrielmaialva33/viva
Catalog: apps/viva_common/priv/gettext/*/LC_MESSAGES/default.po
Languages: pt_br, zh_cn

# meta_learner.deploy_failed
source: Deploy failed: %{reason}
pt_br: Deploy falhou: %{reason}
zh_cn: 部署失败: %{reason}

# meta_learner.deploy_skipped
source: Skipping deploy (not connected)
pt_br: Pulando deploy (não conectado)
zh_cn: 跳过部署（未连接）

# meta_learner.qdrant_skipped
source: Qdrant save skipped (not available)
pt_br: Salvamento Qdrant pulado (não disponível)
zh_cn: 跳过 Qdrant 保存（不可用）

# meta_learner.elites_saved
source: Saved %{count} elites to memory
pt_br: Salvos %{count} elites na memória
zh_cn: 已保存 %{count} 个精英到内存

# meta_learner.would_save_qdrant
source: Would save to Qdrant: %{preview}... metadata=%{metadata}
pt_br: Salvaria no Qdrant: %{preview}... metadata=%{metadata}
zh_cn: 将保存到 Qdrant: %{preview}... 元数据=%{metadata}

# meta_learner.archive_empty
source: Archive empty, reinitializing
pt_br: Arquivo vazio, reinicializando
zh_cn: 档案为空，重新初始化

# uploader.deploying
source: Deploying neural network to %{target}
pt_br: Implantando rede neural em %{target}
zh_cn: 部署神经网络到 %{target}

# uploader.success
source: Deployment successful
pt_br: Implantação bem sucedida
zh_cn: 部署成功

# uploader.failed
source: Deployment failed: %{reason}
pt_br: Implantação falhou: %{reason}
zh_cn: 部署失败: %{reason}

# music.arduino_detected
source: Auto-detected Arduino at %{path}
pt_br: Arduino auto-detectado em %{path}
zh_cn: 在 %{path} 自动检测到 Arduino

# music.improvising
source: Improvising with metrics: %{metrics}
pt_br: Improvisando com métricas: %{metrics}
zh_cn: 使用指标即兴演奏: %{metrics}

# music.pleasant_pattern_detected
source: Pleasant pattern detected. Memorizing...
pt_br: Padrão agradável detectado. Memorizando...
zh_cn: 检测到愉悦模式。正在记忆...

# music.arduino_connected
source: Arduino connected (Active Mode)
pt_br: Arduino conectado (Modo Ativo)
zh_cn: Arduino 已连接 (主动模式)

# music.arduino_disconnected
source: Arduino disconnected
pt_br: Arduino desconectado
zh_cn: Arduino 已断开

# music.simulating_note
source: Simulating note: %{freq}Hz for %{dur}ms
pt_br: Simulando nota: %{freq}Hz por %{dur}ms
zh_cn: 模拟音符: %{freq}Hz 持续 %{dur}ms

# music.simulating_melody
source: Simulating melody: %{notes}
pt_br: Simulando melodia: %{notes}
zh_cn: 模拟旋律: %{notes}

# music.simulating_emotion
source: Simulating emotion: %{emotion}
pt_br: Simulando emoção: %{emotion}
zh_cn: 模拟情绪: %{emotion}

# orchestrate.starting
source: Starting with metrics: %{metrics}
pt_br: Iniciando com métricas: %{metrics}
zh_cn: 使用指标启动: %{metrics}

# orchestrate.fan_set
source: Fan set to %{speed} (arousal: %{arousal})
pt_br: Ventilador em %{speed} (excitação: %{arousal})
zh_cn: 风扇设为 %{speed} (唤醒度: %{arousal})

# orchestrate.playing_notes
source: Playing %{count} notes
pt_br: Tocando %{count} notas
zh_cn: 播放 %{count} 个音符

# orchestrate.final_status
source: Final status: %{status}
pt_br: Status final: %{status}
zh_cn: 最终状态: %{status}

# orchestrate.closed_loop
source: Closed-loop with metrics: %{metrics}
pt_br: Loop fechado com métricas: %{metrics}
zh_cn: 闭环与指标: %{metrics}

# orchestrate.playing_with_rpm
source: Playing %{count} notes, RPM: %{rpm}
pt_br: Tocando %{count} notas, RPM: %{rpm}
zh_cn: 播放 %{count} 个音符, RPM: %{rpm}

# orchestrate.high_rpm_stress
source: High RPM %{rpm} -> stress
pt_br: RPM alto %{rpm} -> estresse
zh_cn: 高 RPM %{rpm} -> 压力

# orchestrate.stable_rpm_comfort
source: Stable RPM %{rpm} -> comfort
pt_br: RPM estável %{rpm} -> conforto
zh_cn: 稳定 RPM %{rpm} -> 舒适

# orchestrate.autonomous_started
source: Autonomous loop started with interval %{interval}ms
pt_br: Loop autônomo iniciado com intervalo %{interval}ms
zh_cn: 自主循环已启动，间隔 %{interval}ms

# orchestrate.error
source: Error: %{reason}
pt_br: Erro: %{reason}
zh_cn: 错误: %{reason}

# codegen.template_error
source: Template error: %{error}
pt_br: Erro no template: %{error}
zh_cn: 模板错误: %{error}

# body.init_bevy_ecs
source: Initializing Bevy ECS Body + Soul Channel...
pt_br: Inicializando Bevy ECS Body + Canal da Alma...
zh_cn: 初始化 Bevy ECS Body + 灵魂通道...

# body.mutex_poisoned
source: WARNING: Mutex poisoned in %{function}, recovering...
pt_br: AVISO: Mutex envenenado em %{function}, recuperando...
zh_cn: 警告: %{function} 中的互斥锁中毒，正在恢复...

# body.wsl2_detected
source: Detected WSL2 environment. Activating Nerve Bridge...
pt_br: Ambiente WSL2 detectado. Ativando Ponte Neural...
zh_cn: 检测到 WSL2 环境。激活神经桥接...

# evolution.initializing_archive
source: Initializing archive (%{grid_size}x%{grid_size} grid)
pt_br: Inicializando arquivo (%{grid_size}x%{grid_size} grade)
zh_cn: 正在初始化存档 (%{grid_size}x%{grid_size} 网格)

# evolution.initial_archive_status
source: Initial archive: %{filled}/%{total} cells filled
pt_br: Arquivo inicial: %{filled}/%{total} células preenchidas
zh_cn: 初始存档: %{filled}/%{total} 单元格已填充

# evolution.starting_evolution
source: Starting evolution: %{iterations} iterations, live=%{live}
pt_br: Iniciando evolução: %{iterations} iterações, live=%{live}
zh_cn: 开始进化: %{iterations} 次迭代, live=%{live}

# evolution.archive_empty_reinit
source: Archive empty, reinitializing
pt_br: Arquivo vazio, reinicializando
zh_cn: 存档为空，正在重新初始化

# evolution.iteration_progress
source: Iteration %{iteration}: %{filled} cells, best fitness: %{best}
pt_br: Iteração %{iteration}: %{filled} células, melhor fitness: %{best}
zh_cn: 迭代 %{iteration}: %{filled} 单元格, 最佳适应度: %{best}

# evolution.evolution_complete
source: Evolution complete: %{filled} cells, coverage: %{coverage}%
pt_br: Evolução completa: %{filled} células, cobertura: %{coverage}%
zh_cn: 进化完成: %{filled} 单元格, 覆盖率: %{coverage}%

# evolution.new_elite
source: New elite at (%{row},%{col}): fitness=%{fitness}
pt_br: Nova elite em (%{row},%{col}): fitness=%{fitness}
zh_cn: 新精英在 (%{row},%{col}): 适应度=%{fitness}

# evolution.live_evaluation_starting
source: Live evaluation starting...
pt_br: Avaliação live iniciando...
zh_cn: 实时评估启动中...

# evolution.live_fitness
source: Live fitness: %{fitness}
pt_br: Fitness live: %{fitness}
zh_cn: 实时适应度: %{fitness}

# evolution.deploy_failed
source: Deploy failed: %{reason}, using simulated
pt_br: Deploy falhou: %{reason}, usando simulado
zh_cn: 部署失败: %{reason}, 使用模拟

# evolution.codegen_failed
source: Codegen failed: %{reason}, using simulated
pt_br: Codegen falhou: %{reason}, usando simulado
zh_cn: 代码生成失败: %{reason}, 使用模拟

# personality.valence.positive
source: positive
zh_cn: 积极

# personality.valence.neutral
source: neutral
zh_cn: 中性

# personality.energy.energetic
source: energetic
zh_cn: 活跃

# personality.energy.calm
source: calm
zh_cn: 平静

# personality.describe
source: I am %{traits}. My emotional baseline is %{valence} and %{energy}. My reactivity is %{reactivity}.
zh_cn: 我是%{traits}。我的情绪基线是%{valence}和%{energy}。我的反应性是%{reactivity}。
