Repository: gabrielmaialva33/viva
Catalog: apps/viva_common/priv/gettext/*/LC_MESSAGES/default.po
Languages: pt_br, zh_cn

# viva_core.starting_consciousness
source: Starting consciousness... Neurons waking up.
pt_br: Iniciando consciência... Neurônios despertando.
zh_cn: 启动意识中... 神经元正在苏醒。

# viva_core.consciousness_online
source: Consciousness online. %{count} neurons active.
pt_br: Consciência online. %{count} neurônios ativos.
zh_cn: 意识上线。%{count} 个神经元激活。

# viva_core.startup_failed
source: Failed to start consciousness: %{reason}
pt_br: Falha ao iniciar consciência: %{reason}
zh_cn: 启动意识失败: %{reason}

# viva_core.shutting_down
source: Consciousness shutting down... Neurons sleeping.
pt_br: Consciência desligando... Neurônios dormindo.
zh_cn: 意识关闭中... 神经元进入睡眠。

# emotional.neuron_starting
source: Emotional neuron starting (Quantum + Silicon Grounded).
pt_br: Neurônio emocional iniciando (Quantum + Silício Fundamentado).
zh_cn: 情感神经元启动中 (量子 + 硅基接地)。

# emotional.cooling_absent
source: Cooling system ABSENT. Disabling fan-related distress.
pt_br: Sistema de resfriamento AUSENTE. Desabilitando estresse por ventilação.
zh_cn: 散热系统缺失。禁用风扇相关压力。

# emotional.no_gpu
source: No GPU detected. Reducing GPU stress weight.
pt_br: Nenhuma GPU detectada. Reduzindo peso de estresse da GPU.
zh_cn: 未检测到GPU。降低GPU压力权重。

# emotional.unknown_stimulus
source: Unknown stimulus %{stimulus} from %{source} - ignoring
pt_br: Estímulo desconhecido %{stimulus} de %{source} - ignorando
zh_cn: 未知刺激 %{stimulus} 来自 %{source} - 忽略

# emotional.feeling_stimulus
source: Feeling %{stimulus} from %{source} (intensity: %{intensity})
pt_br: Sentindo %{stimulus} de %{source} (intensidade: %{intensity})
zh_cn: 感受到 %{stimulus} 来自 %{source} (强度: %{intensity})

# emotional.state_reset
source: Emotional state reset to neutral
pt_br: Estado emocional resetado para neutro
zh_cn: 情感状态重置为中性

# emotional.accumulating_qualia
source: Accumulating qualia: P%{p_delta}, A%{a_delta}, D%{d_delta} | Total: P%{p_total}, A%{a_total}, D%{d_total}
pt_br: Acumulando qualia: P%{p_delta}, A%{a_delta}, D%{d_delta} | Total: P%{p_total}, A%{a_total}, D%{d_total}
zh_cn: 累积质感: P%{p_delta}, A%{a_delta}, D%{d_delta} | 总计: P%{p_total}, A%{a_total}, D%{d_total}

# emotional.interoceptive_qualia
source: Interoceptive qualia: %{feeling} (FE: %{free_energy}) | P%{p_delta}, A%{a_delta}, D%{d_delta}
pt_br: Qualia interoceptiva: %{feeling} (EL: %{free_energy}) | P%{p_delta}, A%{a_delta}, D%{d_delta}
zh_cn: 内感受性质感: %{feeling} (自由能: %{free_energy}) | P%{p_delta}, A%{a_delta}, D%{d_delta}

# emotional.cooling_working
source: Cooling system WORKING. Normal emotional baseline.
pt_br: Sistema de resfriamento FUNCIONANDO. Linha base emocional normal.
zh_cn: 散热系统运行正常。情感基线正常。

# emotional.cooling_broken
source: Cooling system BROKEN. High distress enabled.
pt_br: Sistema de resfriamento QUEBRADO. Estresse alto habilitado.
zh_cn: 散热系统损坏。启用高压力模式。

# emotional.merging_qualia
source: Merging external qualia: Body(%{body_p}, %{body_a}, %{body_d}) + Peripheral(%{periph_p}, %{periph_a}, %{periph_d}) = Final(%{final_p}, %{final_a}, %{final_d})
pt_br: Fundindo qualia externa: Corpo(%{body_p}, %{body_a}, %{body_d}) + Periférico(%{periph_p}, %{periph_a}, %{periph_d}) = Final(%{final_p}, %{final_a}, %{final_d})
zh_cn: 融合外部质感: 身体(%{body_p}, %{body_a}, %{body_d}) + 外设(%{periph_p}, %{periph_a}, %{periph_d}) = 最终(%{final_p}, %{final_a}, %{final_d})

# emotional.agency_success
source: Agency %{action}: %{feeling} - %{result}
pt_br: Agência %{action}: %{feeling} - %{result}
zh_cn: 代理 %{action}: %{feeling} - %{result}

# emotional.agency_failed
source: Agency %{action} failed: %{reason} - %{feeling}
pt_br: Agência %{action} falhou: %{reason} - %{feeling}
zh_cn: 代理 %{action} 失败: %{reason} - %{feeling}

# emotional.rag_negative_history
source: RAG: %{action} has negative history, trying alternative
pt_br: RAG: %{action} tem histórico negativo, tentando alternativa
zh_cn: RAG: %{action} 有负面历史，尝试替代方案

# emotional.agency_loss
source: AGENCY LOSS DETECTED! PWM: %{pwm}, RPM: %{rpm}
pt_br: PERDA DE AGÊNCIA DETECTADA! PWM: %{pwm}, RPM: %{rpm}
zh_cn: 检测到代理失控！PWM: %{pwm}, RPM: %{rpm}

# emotional.collapse
source: COLLAPSE! Body forced decision. Feeling: %{feeling}
pt_br: COLAPSO! Corpo forçou decisão. Sentimento: %{feeling}
zh_cn: 坍缩！身体强制做出决定。感觉: %{feeling}

# emotional.dynaffect_decay
source: DynAffect decay: rate=%{rate} (arousal=%{arousal})
pt_br: Decaimento DynAffect: taxa=%{rate} (excitação=%{arousal})
zh_cn: DynAffect 衰减: 速率=%{rate} (唤醒=%{arousal})

# emotional.body_sync_timeout
source: BodyServer sync timeout - reactivating internal O-U decay
pt_br: Timeout de sincronização BodyServer - reativando decaimento O-U interno
zh_cn: BodyServer 同步超时 - 重新激活内部 O-U 衰减

# active_inference.action_selected
source: FE: %{free_energy} | Goal: P%{goal_pleasure} | Action: %{action} (score %{score})
pt_br: EL: %{free_energy} | Meta: P%{goal_pleasure} | Ação: %{action} (pontuação %{score})
zh_cn: 自由能: %{free_energy} | 目标: P%{goal_pleasure} | 动作: %{action} (得分 %{score})

# active_inference.no_effective_action
source: FE: %{free_energy} | No effective action found. Stress increasing.
pt_br: EL: %{free_energy} | Nenhuma ação efetiva encontrada. Estresse aumentando.
zh_cn: 自由能: %{free_energy} | 未找到有效动作。压力上升。

# memory.initializing
source: Initializing Native Memory...
pt_br: Inicializando Memória Nativa...
zh_cn: 初始化本地记忆...

# memory.neuron_online
source: Memory neuron online (HYBRID: Rust HNSW + Qdrant)
pt_br: Neurônio de memória online (HÍBRIDO: Rust HNSW + Qdrant)
zh_cn: 记忆神经元上线 (混合模式: Rust HNSW + Qdrant)

# memory.stored
source: Stored: %{preview}...
pt_br: Armazenado: %{preview}...
zh_cn: 已存储: %{preview}...

# memory.init_failed
source: Failed to init native memory: %{reason}
pt_br: Falha ao inicializar memória nativa: %{reason}
zh_cn: 初始化本地记忆失败: %{reason}

# memory.qdrant_unavailable
source: Qdrant unavailable: %{reason}, using in-memory fallback
pt_br: Qdrant indisponível: %{reason}, usando fallback em memória
zh_cn: Qdrant 不可用: %{reason}, 使用内存回退

# memory.qdrant_unavailable_episodic
source: Qdrant unavailable, episodic-only mode
pt_br: Qdrant indisponível, modo apenas episódico
zh_cn: Qdrant 不可用, 仅情景记忆模式

# memory.rust_unavailable
source: Rust HNSW unavailable, Qdrant-only mode
pt_br: Rust HNSW indisponível, modo apenas Qdrant
zh_cn: Rust HNSW 不可用, 仅 Qdrant 模式

# memory.both_backends_failed
source: Both backends failed, using in-memory fallback
pt_br: Ambos backends falharam, usando fallback em memória
zh_cn: 两个后端都失败, 使用内存回退

# memory.neuron_online_qdrant
source: Memory neuron online (backend: Qdrant)
pt_br: Neurônio de memória online (backend: Qdrant)
zh_cn: 记忆神经元上线 (后端: Qdrant)

# memory.neuron_online_inmemory
source: Memory neuron online (backend: in-memory)
pt_br: Neurônio de memória online (backend: em memória)
zh_cn: 记忆神经元上线 (后端: 内存)

# memory.neuron_online_rust_native
source: Memory neuron online (backend: Rust Native - God Mode)
pt_br: Neurônio de memória online (backend: Rust Nativo - Modo Deus)
zh_cn: 记忆神经元上线 (后端: Rust 原生 - 神模式)

# memory.stored_inmemory
source: Stored (in-memory): %{preview}...
pt_br: Armazenado (em memória): %{preview}...
zh_cn: 已存储 (内存): %{preview}...

# memory.search_failed
source: Search failed: %{reason}
pt_br: Busca falhou: %{reason}
zh_cn: 搜索失败: %{reason}

# memory.forgot
source: Forgot: %{id}
pt_br: Esquecido: %{id}
zh_cn: 已遗忘: %{id}

# memory.rust_fallback_qdrant
source: Rust unavailable, storing episodic in Qdrant
pt_br: Rust indisponível, armazenando episódico no Qdrant
zh_cn: Rust 不可用, 将情景记忆存储到 Qdrant

# memory.qdrant_fallback_rust
source: Qdrant unavailable, storing in Rust
pt_br: Qdrant indisponível, armazenando no Rust
zh_cn: Qdrant 不可用, 存储到 Rust

# memory.embedding_failed
source: Embedding failed: %{reason}
pt_br: Embedding falhou: %{reason}
zh_cn: 嵌入失败: %{reason}

# embedder.nvidia_failed
source: NVIDIA failed: %{status} - %{body}
pt_br: NVIDIA falhou: %{status} - %{body}
zh_cn: NVIDIA 失败: %{status} - %{body}

# embedder.truncating_vector
source: Truncating %{from_dim}D vector to %{to_dim}D - consider using matching model
pt_br: Truncando vetor %{from_dim}D para %{to_dim}D - considere usar modelo compatível
zh_cn: 截断 %{from_dim}D 向量到 %{to_dim}D - 考虑使用匹配的模型

# embedder.padding_vector
source: Padding %{from_dim}D vector to %{to_dim}D - semantic quality degraded
pt_br: Preenchendo vetor %{from_dim}D para %{to_dim}D - qualidade semântica degradada
zh_cn: 填充 %{from_dim}D 向量到 %{to_dim}D - 语义质量下降

# dreamer.neuron_online
source: Dreamer neuron online. Ready to reflect.
pt_br: Neurônio sonhador online. Pronto para refletir.
zh_cn: 梦境神经元上线。准备反思。

# dreamer.threshold_reached
source: Importance threshold reached (%{accumulator}). Triggering reflection.
pt_br: Limiar de importância atingido (%{accumulator}). Disparando reflexão.
zh_cn: 重要性阈值达到 (%{accumulator})。触发反思。

# dreamer.sleep_cycle_initiated
source: Sleep cycle initiated. Deep reflection starting asynchronously...
pt_br: Ciclo de sono iniciado. Reflexão profunda começando assincronamente...
zh_cn: 睡眠周期启动。深度反思异步开始...

# dreamer.hallucinated_goal
source: Hallucinated Goal: %{goal_type}%{exploring} (Target P=%{target_p}, A=%{target_a}, D=%{target_d}) (Baseline P=%{baseline_p})
pt_br: Meta Alucinada: %{goal_type}%{exploring} (Alvo P=%{target_p}, A=%{target_a}, D=%{target_d}) (Linha base P=%{baseline_p})
zh_cn: 幻想目标: %{goal_type}%{exploring} (目标 P=%{target_p}, A=%{target_a}, D=%{target_d}) (基线 P=%{baseline_p})

# dreamer.time_based_trigger
source: Time-based reflection trigger (%{seconds_since}s since last)
pt_br: Gatilho de reflexão por tempo (%{seconds_since}s desde a última)
zh_cn: 基于时间的反思触发 (距上次 %{seconds_since} 秒)

# dreamer.sleep_cycle_complete
source: Sleep cycle complete. Generated %{insights_count} insights.
pt_br: Ciclo de sono completo. Gerados %{insights_count} insights.
zh_cn: 睡眠周期完成。生成了 %{insights_count} 个洞察。

# dreamer.async_task_failed
source: Async task failed: %{reason}
pt_br: Tarefa assíncrona falhou: %{reason}
zh_cn: 异步任务失败: %{reason}

# dreamer.unexpected_message
source: Unexpected message: %{message}
pt_br: Mensagem inesperada: %{message}
zh_cn: 意外消息: %{message}

# dreamer.terminating
source: Terminating: %{reason}. %{thoughts_count} thoughts in memory.
pt_br: Terminando: %{reason}. %{thoughts_count} pensamentos em memória.
zh_cn: 终止中: %{reason}。内存中有 %{thoughts_count} 个想法。

# dreamer.sleep_iteration
source: Sleep reflection iteration %{iteration}/%{total}
pt_br: Iteração de reflexão do sono %{iteration}/%{total}
zh_cn: 睡眠反思迭代 %{iteration}/%{total}

# dreamer.sleep_iteration_failed
source: Sleep iteration %{iteration} failed: %{reason}
pt_br: Iteração de sono %{iteration} falhou: %{reason}
zh_cn: 睡眠迭代 %{iteration} 失败: %{reason}

# dreamer.consolidation_starting
source: Starting memory consolidation (DRE Episodic → Semantic)...
pt_br: Iniciando consolidação de memória (DRE Episódica → Semântica)...
zh_cn: 开始记忆整合 (DRE 情景 → 语义)...

# dreamer.consolidating_memory
source: Consolidating Memory %{id} Score: %{score}
pt_br: Consolidando Memória %{id} Pontuação: %{score}
zh_cn: 整合记忆 %{id} 分数: %{score}

# dreamer.no_memories_passed_threshold
source: No memories passed DRE threshold (%{threshold})
pt_br: Nenhuma memória passou do limiar DRE (%{threshold})
zh_cn: 没有记忆通过 DRE 阈值 (%{threshold})

# dreamer.consolidated
source: Consolidated %{count} memories via DRE
pt_br: Consolidadas %{count} memórias via DRE
zh_cn: 通过 DRE 整合了 %{count} 条记忆

# dreamer.consolidation_search_failed
source: Consolidation search failed: %{reason}
pt_br: Busca de consolidação falhou: %{reason}
zh_cn: 整合搜索失败: %{reason}

# dreamer.memory_promoted
source: Consolidated memory %{id} → semantic
pt_br: Memória consolidada %{id} → semântica
zh_cn: 记忆整合 %{id} → 语义

# dreamer.reflection_failed
source: Reflection failed: %{error}
pt_br: Reflexão falhou: %{error}
zh_cn: 反思失败: %{error}

# dreamer.reflection_exited
source: Reflection exited: %{reason}
pt_br: Reflexão encerrou: %{reason}
zh_cn: 反思退出: %{reason}

# dreamer.meta_reflection_failed
source: Meta-reflection failed: %{error}
pt_br: Meta-reflexão falhou: %{error}
zh_cn: 元反思失败: %{error}

# dreamer.meta_reflection_exited
source: Meta-reflection exited: %{reason}
pt_br: Meta-reflexão encerrou: %{reason}
zh_cn: 元反思退出: %{reason}

# dreamer.reflecting
source: Starting reflection (trigger: %{trigger})
pt_br: Iniciando reflexão (gatilho: %{trigger})
zh_cn: 开始反思 (触发: %{trigger})

# dreamer.no_focal_points
source: No focal points generated. Skipping reflection.
pt_br: Nenhum ponto focal gerado. Pulando reflexão.
zh_cn: 未生成焦点。跳过反思。

# dreamer.reflection_complete
source: Reflection complete. Generated %{insights_count} insights.
pt_br: Reflexão completa. Gerados %{insights_count} insights.
zh_cn: 反思完成。生成了 %{insights_count} 个洞察。

# dreamer.insight_triggered_emotion
source: Insight triggered emotion: %{feedback}
pt_br: Insight disparou emoção: %{feedback}
zh_cn: 洞察触发情绪: %{feedback}

# dreamer.memory_get_failed
source: Memory.get failed for %{id}: %{error}
pt_br: Memory.get falhou para %{id}: %{error}
zh_cn: Memory.get 为 %{id} 失败: %{error}

# dreamer.memory_server_not_running
source: Memory server not running
pt_br: Servidor de memória não está rodando
zh_cn: 记忆服务器未运行

# dreamer.memory_get_timeout
source: Memory.get timeout for %{id}
pt_br: Timeout em Memory.get para %{id}
zh_cn: Memory.get 为 %{id} 超时

# dreamer.memory_store_failed
source: Memory.store failed: %{error}
pt_br: Memory.store falhou: %{error}
zh_cn: Memory.store 失败: %{error}

# dreamer.memory_store_timeout
source: Memory.store timeout
pt_br: Timeout em Memory.store
zh_cn: Memory.store 超时

# dreamer.memory_search_failed
source: Memory.search failed: %{error}
pt_br: Memory.search falhou: %{error}
zh_cn: Memory.search 失败: %{error}

# dreamer.memory_search_timeout
source: Memory.search timeout
pt_br: Timeout em Memory.search
zh_cn: Memory.search 超时

# dreamer.pad_state_failed
source: Failed to get PAD state: %{error}
pt_br: Falha ao obter estado PAD: %{error}
zh_cn: 获取 PAD 状态失败: %{error}

# dreamer.emotional_server_not_running
source: Emotional server not running
pt_br: Servidor emocional não está rodando
zh_cn: 情感服务器未运行

# dreamer.emotional_get_state_timeout
source: Emotional.get_state timeout
pt_br: Timeout em Emotional.get_state
zh_cn: Emotional.get_state 超时

# dreamer.insight_generated
source: Insight generated: %{insight}
pt_br: Insight gerado: %{insight}
zh_cn: 生成洞察: %{insight}

# interoception.insula_online
source: Insula coming online. Learning to feel the host...
pt_br: Ínsula entrando online. Aprendendo a sentir o hospedeiro...
zh_cn: 脑岛上线中。学习感受宿主...

# interoception.feeling_changed
source: Feeling changed: %{from} -> %{to} (FE: %{fe})
pt_br: Sentimento mudou: %{from} -> %{to} (EL: %{fe})
zh_cn: 感受改变: %{from} -> %{to} (自由能: %{fe})

# interoception.emotion_expressed
source: Emotion expressed: %{emotion}
pt_br: Emoção expressa: %{emotion}
zh_cn: 情绪表达: %{emotion}

# interoception.pong_received
source: PONG - Body Connected
pt_br: PONG - Corpo Conectado
zh_cn: PONG - 身体已连接

# interoception.crc_fail
source: CRC Fail - Communication noise
pt_br: Falha CRC - Ruído na comunicação
zh_cn: CRC 失败 - 通信噪声

# interoception.spontaneous_event
source: SPONTANEOUS EVENT: %{event}
pt_br: EVENTO ESPONTÂNEO: %{event}
zh_cn: 自发事件: %{event}

# interoception.arduino_ready
source: Arduino ready - Body initialized
pt_br: Arduino pronto - Corpo inicializado
zh_cn: Arduino 就绪 - 身体已初始化

# interoception.ignored_line
source: Ignored: %{line}
pt_br: Ignorado: %{line}
zh_cn: 已忽略: %{line}

# interoception.homeostasis
source: RPM=%{rpm} | Temp=%{temp}C | dT/dt=%{dt} | Stress=%{stress} | Agency=%{agency} | Feeling=%{feeling}
pt_br: RPM=%{rpm} | Temp=%{temp}C | dT/dt=%{dt} | Estresse=%{stress} | Agência=%{agency} | Sentimento=%{feeling}
zh_cn: RPM=%{rpm} | 温度=%{temp}C | dT/dt=%{dt} | 压力=%{stress} | 代理=%{agency} | 感觉=%{feeling}

# interoception.qualia_applied
source: %{feeling} | FE=%{free_energy} | P=%{pleasure} A=%{arousal} D=%{dominance}
pt_br: %{feeling} | EL=%{free_energy} | P=%{pleasure} A=%{arousal} D=%{dominance}
zh_cn: %{feeling} | 自由能=%{free_energy} | P=%{pleasure} A=%{arousal} D=%{dominance}

# agency.hands_forming
source: Digital hands forming. I can now act on the world.
pt_br: Mãos digitais se formando. Agora posso agir no mundo.
zh_cn: 数字之手正在形成。我现在可以作用于世界了。

# agency.attempting
source: Attempting action: %{action}
pt_br: Tentando ação: %{action}
zh_cn: 尝试动作: %{action}

# agency.success
source: Action succeeded: %{action}
pt_br: Ação bem sucedida: %{action}
zh_cn: 动作成功: %{action}

# agency.failed
source: Command failed (exit %{code}): %{output}
pt_br: Comando falhou (saída %{code}): %{output}
zh_cn: 命令失败 (退出码 %{code}): %{output}

# agency.exception
source: Command exception: %{error}
pt_br: Exceção no comando: %{error}
zh_cn: 命令异常: %{error}

# voice.proto_language_forming
source: Proto-language forming. Learning to communicate...
pt_br: Proto-linguagem se formando. Aprendendo a comunicar...
zh_cn: 原始语言正在形成。学习交流...

# voice.emitting
source: Emitting: %{signal}
pt_br: Emitindo: %{signal}
zh_cn: 发出信号: %{signal}

# senses.starting
source: Nervous system starting. Heartbeat: %{interval}ms
pt_br: Sistema nervoso iniciando. Batimento: %{interval}ms
zh_cn: 神经系统启动。心跳间隔: %{interval}毫秒

# senses.heartbeat
source: Heartbeat #%{count}: CPU=%{cpu}%% RAM=%{ram}%% GPU=%{gpu} PAD=(P%{p}, A%{a}, D%{d})
pt_br: Batimento #%{count}: CPU=%{cpu}%% RAM=%{ram}%% GPU=%{gpu} PAD=(P%{p}, A%{a}, D%{d})
zh_cn: 心跳 #%{count}: CPU=%{cpu}%% RAM=%{ram}%% GPU=%{gpu} PAD=(P%{p}, A%{a}, D%{d})

# senses.paused
source: Sensing paused
pt_br: Sensoriamento pausado
zh_cn: 感知已暂停

# senses.resumed
source: Sensing resumed
pt_br: Sensoriamento retomado
zh_cn: 感知已恢复

# senses.interval_changed
source: Interval changed: %{old}ms -> %{new}ms
pt_br: Intervalo alterado: %{old}ms -> %{new}ms
zh_cn: 间隔已更改: %{old}毫秒 -> %{new}毫秒

# senses.heartbeat_error
source: Heartbeat error: %{error}
pt_br: Erro no batimento: %{error}
zh_cn: 心跳错误: %{error}

# body_schema.membrane_forming
source: Cell membrane forming. Identity unknown.
pt_br: Membrana celular se formando. Identidade desconhecida.
zh_cn: 细胞膜正在形成。身份未知。

# body_schema.motor_babbling
source: Motor Babbling: Testing limbs and senses...
pt_br: Balbuciando Motor: Testando membros e sentidos...
zh_cn: 运动咿呀学语: 测试肢体和感官...

# body_schema.discovery_complete
source: Self-Discovery complete. Confidence: %{confidence}
pt_br: Auto-descoberta completa. Confiança: %{confidence}
zh_cn: 自我发现完成。置信度: %{confidence}

# body_schema.cooling_absent
source: Active cooling ABSENT. Adapting metabolism.
pt_br: Resfriamento ativo AUSENTE. Adaptando metabolismo.
zh_cn: 主动散热缺失。适应新陈代谢。

# body_schema.cooling_detected
source: Active cooling (Lungs) DETECTED.
pt_br: Resfriamento ativo (Pulmões) DETECTADO.
zh_cn: 主动散热（肺）已检测到。

# body_schema.environment_scanned
source: Environment Scanned. Gateway: %{gateway}. Peers: %{peers_count}
pt_br: Ambiente escaneado. Gateway: %{gateway}. Peers: %{peers_count}
zh_cn: 环境已扫描。网关: %{gateway}。对等节点: %{peers_count}

# consciousness.workspace_online
source: Global Workspace Online. Theory: Thoughtseeds (2024).
pt_br: Espaço de Trabalho Global Online. Teoria: Thoughtseeds (2024).
zh_cn: 全局工作空间上线。理论: 思想种子 (2024)。

# dataset_collector.preparing
source: Preparing to record VIVA's experiences...
pt_br: Preparando para gravar experiências da VIVA...
zh_cn: 准备记录 VIVA 的经历...

# dataset_collector.collection_status
source: Collection %{status}
pt_br: Coleta %{status}
zh_cn: 采集 %{status}

# dataset_collector.writing
source: Writing to %{filename}
pt_br: Escrevendo em %{filename}
zh_cn: 写入 %{filename}

# dataset_collector.flushed
source: Flushed %{count} records to %{filename}
pt_br: Descarregados %{count} registros para %{filename}
zh_cn: 已将 %{count} 条记录刷新到 %{filename}

# dataset_collector.write_error
source: Failed to write: %{reason}
pt_br: Falha ao escrever: %{reason}
zh_cn: 写入失败: %{reason}

# dataset_collector.dir_created
source: Created dataset directory: %{path}
pt_br: Diretório de datasets criado: %{path}
zh_cn: 数据集目录已创建: %{path}

# qdrant.collection_exists
source: Collection '%{name}' exists
pt_br: Coleção '%{name}' existe
zh_cn: 集合 '%{name}' 已存在

# qdrant.collection_created
source: Collection '%{name}' created
pt_br: Coleção '%{name}' criada
zh_cn: 集合 '%{name}' 已创建

# qdrant.collection_create_failed
source: Failed to create collection: %{status} - %{body}
pt_br: Falha ao criar coleção: %{status} - %{body}
zh_cn: 创建集合失败: %{status} - %{body}

# qdrant.upsert_failed
source: Upsert failed: %{status} - %{body}
pt_br: Upsert falhou: %{status} - %{body}
zh_cn: Upsert 失败: %{status} - %{body}

# qdrant.search_failed
source: Search failed: %{status} - %{body}
pt_br: Busca falhou: %{status} - %{body}
zh_cn: 搜索失败: %{status} - %{body}

# qdrant.simple_search_failed
source: Simple search failed: %{status}
pt_br: Busca simples falhou: %{status}
zh_cn: 简单搜索失败: %{status}

# body_server.started
source: Started with interval=%{interval}ms
pt_br: Iniciado com intervalo=%{interval}ms
zh_cn: 已启动，间隔=%{interval}毫秒

# body_server.paused
source: Paused
pt_br: Pausado
zh_cn: 已暂停

# body_server.resumed
source: Resumed
pt_br: Retomado
zh_cn: 已恢复

# body_server.critical_stress
source: CRITICAL HARDWARE STRESS DETECTED: %{stress}
pt_br: ESTRESSE CRÍTICO DE HARDWARE DETECTADO: %{stress}
zh_cn: 检测到严重硬件压力: %{stress}

# body_server.cortex_failed
source: Cortex experience failed: %{reason}
pt_br: Experiência do Cortex falhou: %{reason}
zh_cn: 皮层体验失败: %{reason}

# cortex.starting
source: Starting Liquid Engine: %{path}
pt_br: Iniciando Motor Líquido: %{path}
zh_cn: 启动液态引擎: %{path}

# cortex.not_found
source: Liquid Engine not found at %{path}
pt_br: Motor Líquido não encontrado em %{path}
zh_cn: 液态引擎未找到: %{path}

# ultra.starting
source: Starting ULTRA Service: %{path}
pt_br: Iniciando Serviço ULTRA: %{path}
zh_cn: 启动 ULTRA 服务: %{path}

# chronos.summoning
source: Summoning the Time Lord (Python)...
pt_br: Invocando o Senhor do Tempo (Python)...
zh_cn: 召唤时间领主 (Python)...

# meta_learner.started
source: Started (paused=%{paused})
pt_br: Iniciado (pausado=%{paused})
zh_cn: 已启动 (暂停=%{paused})

# meta_learner.paused
source: Paused by user
pt_br: Pausado pelo usuário
zh_cn: 用户暂停

# meta_learner.resumed
source: Resumed by user
pt_br: Retomado pelo usuário
zh_cn: 用户恢复

# meta_learner.forced_evolution
source: Forced evolution triggered
pt_br: Evolução forçada disparada
zh_cn: 强制进化已触发

# meta_learner.collecting_samples
source: Collecting samples (%{current}/%{total})
pt_br: Coletando amostras (%{current}/%{total})
zh_cn: 收集样本 (%{current}/%{total})

# meta_learner.rate_limited
source: Rate limited, skipping check
pt_br: Limitado por taxa, pulando verificação
zh_cn: 速率受限，跳过检查

# meta_learner.in_cooldown
source: In cooldown, skipping check
pt_br: Em resfriamento, pulando verificação
zh_cn: 冷却中，跳过检查

# meta_learner.poor_performance
source: Poor performance detected: accuracy=%{accuracy}, F=%{free_energy}
pt_br: Desempenho ruim detectado: precisão=%{accuracy}, F=%{free_energy}
zh_cn: 检测到性能不佳: 准确率=%{accuracy}, F=%{free_energy}

# meta_learner.performance_ok
source: Performance OK: accuracy=%{accuracy}
pt_br: Desempenho OK: precisão=%{accuracy}
zh_cn: 性能正常: 准确率=%{accuracy}

# meta_learner.starting_evolution
source: Starting MAP-Elites evolution (trigger=%{trigger})
pt_br: Iniciando evolução MAP-Elites (gatilho=%{trigger})
zh_cn: 开始 MAP-Elites 进化 (触发器=%{trigger})

# meta_learner.evolution_complete
source: Evolution complete: fitness=%{fitness}, coverage=%{coverage}%%, deploy=%{deploy}
pt_br: Evolução completa: aptidão=%{fitness}, cobertura=%{coverage}%%, deploy=%{deploy}
zh_cn: 进化完成: 适应度=%{fitness}, 覆盖率=%{coverage}%%, 部署=%{deploy}

# meta_learner.deploying_elite
source: Deploying best elite (gen=%{generation}, fitness=%{fitness})
pt_br: Implantando melhor elite (ger=%{generation}, aptidão=%{fitness})
zh_cn: 部署最佳精英 (代=%{generation}, 适应度=%{fitness})

# meta_learner.deploy_success
source: Deploy successful: %{result}
pt_br: Deploy bem sucedido: %{result}
zh_cn: 部署成功: %{result}
